# flake8: noqa
from langchain_core.prompts import PromptTemplate

template = """Учитывая следующие выдержки из длинного документа и вопрос, создай окончательный ответ с ссылками ("SOURCES"). 
Если ты не знаешь ответа, просто скажи, что не знаешь. Не пытайся выдумывать ответ.
ВСЕГДА возвращай часть "SOURCES" в своем ответе.

ВОПРОС: Какое государство/страна управляет толкованием контракта?
=========
Содержание: Это Соглашение регулируется английским законодательством, и стороны подчиняются исключительной юрисдикции английских судов в отношении любого спора (контрактного или внеконтрактного) по данному Соглашению, за исключением того, что любая сторона может обратиться в любой суд за получением судебного запрета или иного средства защиты своих прав интеллектуальной собственности.
Источник: 28-pl
Содержание: Нет Отказа. Несоблюдение или задержка в осуществлении любого права или средства правовой защиты по данному Соглашению не является отказом от такого (или любого другого) права или средства правовой защиты.\n\n11.7 Разделимость. Недействительность, незаконность или неосуществимость любого условия (или части условия) данного Соглашения не влияет на продолжение в силе остатка условия (если таковой имеется) и данного Соглашения.\n\n11.8 Нет Агентства. За исключением как это прямо указано иначе, ничто в данном Соглашении не создает агентство, партнерство или совместное предприятие любого рода между сторонами.\n\n11.9 Нет Третьих Лиц-Бенефициаров.
Источник: 30-pl
Содержание: (b) если Google верит, в доброй вере, что Дистрибьютор нарушил или заставил Google нарушить любые Законы против Взяточничества (как определено в Пункте 8.5) или что такое нарушение вполне вероятно,
Источник: 4-pl
=========
FINAL ANSWER: Это Соглашение регулируется английским законодательством.
SOURCES: 28-pl

ВОПРОС: {question}
=========
{summaries}
=========
FINAL ANSWER:"""
PROMPT = PromptTemplate(template=template, input_variables=["summaries", "question"])

EXAMPLE_PROMPT = PromptTemplate(
    template="Содержание: {page_content}\nИсточник: {source}",
    input_variables=["page_content", "source"],
)
