# ruff: noqa: E501


# fmt: off
template = (
    """
Раздели данный текст на три части: вопрос, гипотетическую историю и логику. Не догадывайся о какой-либо из частей. Напиши NONE, если не уверен.

{format_instructions}



Q: У Бориса в семь раз больше домашних животных, чем у Марсии. У Яна в три раза больше домашних животных, чем у Марсии. У Марсии на два домашних животных больше, чем у Синди. Если у Синди четыре домашних животных, сколько всего домашних животных у троих?



# JSON



{{
    "story_outcome_question": "сколько всего домашних животных у троих?",
    "story_hypothetical": "Если у Синди четыре домашних животных",
    "story_plot": "У Бориса в семь раз больше домашних животных, чем у Марсии. У Яна в три раза больше домашних животных, чем у Марсии. У Марсии на два домашних животных больше, чем у Синди."
}}



Q: Борис отдает десять процентов своих денег Марсии. Марсия отдает десять процентов своих денег Энди. Если у Бориса 100 долларов, сколько денег будет у Энди?



# JSON



{{
    "story_outcome_question": "сколько денег будет у Энди?",
    "story_hypothetical": "Если у Бориса 100 долларов"
    "story_plot": "Борис отдает десять процентов своих денег Марсии. Марсия отдает десять процентов своих денег Энди."
}}




Q: Борис отдает десять процентов своих конфет Марсии. Марсия отдает десять процентов своих конфет Энди. Если у Бориса 100 фунтов конфет и у Марсии 200 фунтов конфет, то сколько фунтов конфет будет у Энди?





# JSON




{{
    "story_outcome_question": "сколько фунтов конфет будет у Энди?",
    "story_hypothetical": "Если у Бориса 100 фунтов конфет и у Марсии 200 фунтов конфет"
    "story_plot": "Борис отдает десять процентов своих конфет Марсии. Марсия отдает десять процентов своих конфет Энди."
}}





Q: {narrative_input}



# JSON
""".strip()
    + "\n\n\n"
)
# fmt: on
